// 1С Предприятие 8.3
// На Сервере

// Найти найти значение перечисления по его имени
// Вариант 1 :

&НаСервере
Функция ПолучитьЗначениеПеречисленияПоИмени(ТекИмя)
    ЗначениеПеречисления = Неопределенно;
    Попытка
        ЗначениеПеречисления = Перечисления.ЕдиницыИзмерения[ТекИмя];
    Исключение
        Сообщить("Такой единицы измерения - " + ТекИмя + " несуществет пропускаем !");
    КонецПопытки;
    Возврат ЗначениеПеречисления;
КонецФункции

// Вариант 2 :
&НаСервере
Функция ПолучитьЗначениеПеречисленияПоИмени(ТекИмя)
    мета = Метаданные.Перечисления.ЕдиницыИзмерения.ЗначенияПеречисления.Найти(ТекИмя);
	Если мета <> Неопределено Тогда
	    Возврат Перечисления.ЕдиницыИзмерения[мета.Имя];
    КонецЕсли;
    Возврат Неопределенно;
КонецФункции


// Вариант 3 :
&НаСервере
Функция ПолучитьЗначениеПеречисленияПоИмени(ТекИмя)
    Для каждого текЕдиница Из Метаданные.Перечисления.ЕдиницыИзмерения.ЗначенияПеречисления Цикл
        Сообщить(текЕдиница.ПолучитьИменаПредопределенных());
		Если текЕдиница.ПолноеИмя() = ТекИмя Тогда
		    Возврат текЕдиница;
		КонецЕсли;
	КонецЦикла;
	Возрат Неопределенно;
КонецФункции
